=========================================================================================================
Layer (type:depth-idx)                                  Output Shape              Param #
=========================================================================================================
BartForConditionalGeneration                            [32, 64, 768]             --
├─BartModel: 1-1                                        [32, 64, 768]             --
│    └─BartEncoder: 2-1                                 [32, 64, 768]             --
│    │    └─Embedding: 3-1                              [32, 64, 768]             (38,603,520)
│    │    └─BartLearnedPositionalEmbedding: 3-2         [32, 64, 768]             (787,968)
│    │    └─LayerNorm: 3-3                              [32, 64, 768]             (1,536)
│    │    └─ModuleList: 3-4                             --                        --
│    │    │    └─BartEncoderLayer: 4-1                  [32, 64, 768]             (7,087,872)
│    │    │    └─BartEncoderLayer: 4-2                  [32, 64, 768]             (7,087,872)
│    │    │    └─BartEncoderLayer: 4-3                  [32, 64, 768]             (7,087,872)
│    │    │    └─BartEncoderLayer: 4-4                  [32, 64, 768]             (7,087,872)
│    │    │    └─BartEncoderLayer: 4-5                  [32, 64, 768]             (7,087,872)
│    │    │    └─BartEncoderLayer: 4-6                  [32, 64, 768]             (7,087,872)
│    └─BartDecoder: 2-2                                 [32, 64, 768]             --
│    │    └─Embedding: 3-5                              [32, 64, 768]             (38,603,520)
│    │    └─BartLearnedPositionalEmbedding: 3-6         [32, 64, 768]             (787,968)
│    │    └─LayerNorm: 3-7                              [32, 64, 768]             (1,536)
│    │    └─ModuleList: 3-8                             --                        --
│    │    │    └─BartDecoderLayer: 4-7                  [32, 64, 768]             (9,451,776)
│    │    │    └─BartDecoderLayer: 4-8                  [32, 64, 768]             (9,451,776)
│    │    │    └─BartDecoderLayer: 4-9                  [32, 64, 768]             (9,451,776)
│    │    │    └─BartDecoderLayer: 4-10                 [32, 64, 768]             (9,451,776)
│    │    │    └─BartDecoderLayer: 4-11                 [32, 64, 768]             (9,451,776)
│    │    │    └─BartDecoderLayer: 4-12                 [32, 64, 768]             (9,451,776)
├─Linear: 1-2                                           [32, 64, 50265]           (38,603,520)
=========================================================================================================
Total params: 216,627,456
Trainable params: 0
Non-trainable params: 216,627,456
Total mult-adds (Units.GIGABYTES): 6.93
=========================================================================================================
Input size (MB): 0.08
Forward/backward pass size (MB): 2937.47
Params size (MB): 866.51
Estimated Total Size (MB): 3804.06
========================================================================================================================================================================================================
Layer (type:depth-idx)                        Output Shape              Param #
===============================================================================================
PerceiverAutoEncoder                          [32, 32, 768]             --
├─PerceiverResampler: 1-1                     [32, 32, 64]              2,048
│    └─AbsolutePositionalEmbedding: 2-1       [64, 768]                 --
│    │    └─Embedding: 3-1                    [64, 768]                 49,152
│    └─ModuleList: 2-2                        --                        --
│    │    └─ModuleList: 3-2                   --                        --
│    │    │    └─PerceiverAttention: 4-1      [32, 32, 64]              1,378,112
│    │    │    └─Sequential: 4-2              [32, 32, 64]              33,216
│    │    └─ModuleList: 3-3                   --                        --
│    │    │    └─PerceiverAttention: 4-3      [32, 32, 64]              1,378,112
│    │    │    └─Sequential: 4-4              [32, 32, 64]              33,216
│    │    └─ModuleList: 3-4                   --                        --
│    │    │    └─PerceiverAttention: 4-5      [32, 32, 64]              1,378,112
│    │    │    └─Sequential: 4-6              [32, 32, 64]              33,216
│    └─LayerNorm: 2-3                         [32, 32, 64]              128
├─Transformer: 1-2                            [32, 32, 768]             --
│    └─Linear: 2-4                            [32, 32, 768]             49,920
│    └─AbsolutePositionalEmbedding: 2-5       [32, 768]                 --
│    │    └─Embedding: 3-5                    [32, 768]                 24,576
│    └─ModuleList: 2-6                        --                        --
│    │    └─ModuleList: 3-6                   --                        --
│    │    │    └─Attention: 4-7               [32, 32, 768]             2,361,728
│    │    │    └─Sequential: 4-8              [32, 32, 768]             4,723,968
│    │    └─ModuleList: 3-7                   --                        --
│    │    │    └─Attention: 4-9               [32, 32, 768]             2,361,728
│    │    │    └─Sequential: 4-10             [32, 32, 768]             4,723,968
│    │    └─ModuleList: 3-8                   --                        --
│    │    │    └─Attention: 4-11              [32, 32, 768]             2,361,728
│    │    │    └─Sequential: 4-12             [32, 32, 768]             4,723,968
│    └─LayerNorm: 2-7                         [32, 32, 768]             1,536
===============================================================================================
Total params: 25,618,432
Trainable params: 25,618,432
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 821.27
===============================================================================================
Input size (MB): 6.31
Forward/backward pass size (MB): 517.01
Params size (MB): 102.47
Estimated Total Size (MB): 625.79
===============================================================================================